benchmark/go-frameworks/results/20260924-102750/results/get/gin/r2/60000.txt
Running 40s test @ http://10.128.0.4:8083/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.077ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.077ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.199ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.080ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.109ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.078ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.078ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.084ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.076ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.080ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.078ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  723.16us  20.19ms   83.08%
    Req/Sec     3.96k   461.85     7.22k    81.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.38ms
 90.000%    1.75ms
 99.000%    3.94ms
 99.900%    7.01ms
 99.990%   12.06ms
 99.999%   16.27ms
100.000%   20.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.095     0.000000            1         1.00
       0.418     0.100000       179258         1.11
       0.589     0.200000       358085         1.25
       0.744     0.300000       537218         1.43
       0.888     0.400000       716298         1.67
       1.025     0.500000       895434         2.00
       1.093     0.550000       984973         2.22
       1.162     0.600000      1075148         2.50
       1.232     0.650000      1164265         2.86
       1.304     0.700000      1253786         3.33
       1.380     0.750000      1343544         4.00
       1.421     0.775000      1388304         4.44
       1.466     0.800000      1432840         5.00
       1.517     0.825000      1477073         5.71
       1.578     0.850000      1522078         6.67
       1.653     0.875000      1566734         8.00
       1.698     0.887500      1588901         8.89
       1.752     0.900000      1611467        10.00
       1.815     0.912500      1633891        11.43
       1.893     0.925000      1656180        13.33
       1.997     0.937500      1678564        16.00
       2.065     0.943750      1689687        17.78
       2.155     0.950000      1700928        20.00
       2.277     0.956250      1711996        22.86
       2.443     0.962500      1723247        26.67
       2.655     0.968750      1734425        32.00
       2.773     0.971875      1739964        35.56
       2.911     0.975000      1745593        40.00
       3.059     0.978125      1751154        45.71
       3.231     0.981250      1756753        53.33
       3.429     0.984375      1762324        64.00
       3.547     0.985938      1765169        71.11
       3.677     0.987500      1767925        80.00
       3.835     0.989062      1770725        91.43
       4.017     0.990625      1773510       106.67
       4.231     0.992188      1776330       128.00
       4.363     0.992969      1777712       142.22
       4.499     0.993750      1779112       160.00
       4.655     0.994531      1780535       182.86
       4.839     0.995313      1781902       213.33
       5.059     0.996094      1783313       256.00
       5.199     0.996484      1784007       284.44
       5.367     0.996875      1784708       320.00
       5.543     0.997266      1785407       365.71
       5.751     0.997656      1786106       426.67
       5.991     0.998047      1786796       512.00
       6.147     0.998242      1787146       568.89
       6.327     0.998437      1787500       640.00
       6.547     0.998633      1787853       731.43
       6.767     0.998828      1788201       853.33
       7.051     0.999023      1788547      1024.00
       7.219     0.999121      1788724      1137.78
       7.435     0.999219      1788895      1280.00
       7.699     0.999316      1789069      1462.86
       8.019     0.999414      1789244      1706.67
       8.503     0.999512      1789418      2048.00
       8.791     0.999561      1789506      2275.56
       9.055     0.999609      1789593      2560.00
       9.503     0.999658      1789682      2925.71
       9.887     0.999707      1789768      3413.33
      10.447     0.999756      1789856      4096.00
      10.695     0.999780      1789900      4551.11
      11.079     0.999805      1789944      5120.00
      11.295     0.999829      1789989      5851.43
      11.535     0.999854      1790030      6826.67
      11.775     0.999878      1790074      8192.00
      11.943     0.999890      1790096      9102.22
      12.135     0.999902      1790119     10240.00
      12.423     0.999915      1790140     11702.86
      12.695     0.999927      1790161     13653.33
      13.023     0.999939      1790184     16384.00
      13.191     0.999945      1790195     18204.44
      13.351     0.999951      1790205     20480.00
      13.583     0.999957      1790216     23405.71
      13.799     0.999963      1790227     27306.67
      14.055     0.999969      1790238     32768.00
      14.383     0.999973      1790243     36408.89
      14.591     0.999976      1790249     40960.00
      14.703     0.999979      1790254     46811.43
      15.087     0.999982      1790260     54613.33
      15.695     0.999985      1790265     65536.00
      15.831     0.999986      1790269     72817.78
      16.071     0.999988      1790271     81920.00
      16.231     0.999989      1790273     93622.86
      16.367     0.999991      1790276    109226.67
      16.607     0.999992      1790280    131072.00
      16.607     0.999993      1790280    145635.56
      17.119     0.999994      1790282    163840.00
      17.375     0.999995      1790283    187245.71
      17.791     0.999995      1790284    218453.33
      18.031     0.999996      1790286    262144.00
      18.031     0.999997      1790286    291271.11
      18.719     0.999997      1790287    327680.00
      18.751     0.999997      1790288    374491.43
      18.751     0.999998      1790288    436906.67
      19.263     0.999998      1790289    524288.00
      19.263     0.999998      1790289    582542.22
      19.439     0.999998      1790290    655360.00
      19.439     0.999999      1790290    748982.86
      19.439     0.999999      1790290    873813.33
      19.791     0.999999      1790291   1048576.00
      19.791     0.999999      1790291   1165084.44
      19.791     0.999999      1790291   1310720.00
      19.791     0.999999      1790291   1497965.71
      19.791     0.999999      1790291   1747626.67
      20.207     1.000000      1790292   2097152.00
      20.207     1.000000      1790292          inf
#[Mean    =        1.116, StdDeviation   =        0.723]
#[Max     =       20.192, Total count    =      1790292]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2388467 requests in 40.00s, 865.57MB read
Requests/sec:  59706.50
Transfer/sec:     21.64MB